In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [3]:
#df = pd.read_clipboard()

In [4]:
#df.head()

      Intel 4004  2,300     1971              Intel  10,000 nm  12 mm²
0     Intel 8008  3,500     1972              Intel  10,000 nm  14 mm²
1     Intel 8080  4,500     1974              Intel   6,000 nm  20 mm²
2  Motorola 6800  4,100     1974           Motorola   6,000 nm  16 mm²
3       RCA 1802  5,000     1974                RCA   5,000 nm  27 mm²
4       TMS 1000  8,000  1974[7]  Texas Instruments   8,000 nm     NaN

In [5]:
#df.to_csv('moores.csv')

In [14]:
df = pd.read_csv('moores.csv', index_col=0)

In [15]:
df.head()

      Intel 4004  2,300     1971              Intel  10,000 nm  12 mm²
0     Intel 8008  3,500     1972              Intel  10,000 nm  14 mm²
1     Intel 8080  4,500     1974              Intel   6,000 nm  20 mm²
2  Motorola 6800  4,100     1974           Motorola   6,000 nm  16 mm²
3       RCA 1802  5,000     1974                RCA   5,000 nm  27 mm²
4       TMS 1000  8,000  1974[7]  Texas Instruments   8,000 nm     NaN